tap "blacknon/hwatch"
tap "buo/cask-upgrade"
tap "cantino/mcfly"
tap "derailed/k9s"
tap "elastic/tap"
tap "goodwithtech/r"
tap "jetbrains/utils"
tap "johanhaleby/kubetail"Í
tap "kubeshark/kubeshark"
tap "mongodb/brew"
tap "mveritym/mel"
tap "pivotal/tap"
tap "restcli/restcli"
tap "romkatv/powerlevel10k"
tap "schappim/ocr"
tap "spring-io/tap"
tap "wagoodman/dive"

# brew installs (brew install)
brew "adr-tools"
brew "ansible"
brew "ansible-lint"
brew "ant"
brew "aom"
brew "asciinema"
brew "at-spi2-core"
brew "autoconf"
brew "autojump"
brew "automake"
brew "awscli"
brew "bash"
brew "black"
brew "broot"
brew "cairo"
brew "cffi"
brew "cidr"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "cryptography"
brew "cscope"
brew "ctags"
brew "dasel"
brew "dbus"
brew "derailed/k9s/k9s"
brew "detekt"
brew "direnv"
brew "dive"
brew "docutils"
brew "dos2unix"
brew "duckdb"
brew "extract_url"
brew "eza"
brew "faas-cli"
brew "figlet"
brew "fontconfig"
brew "fortune"
brew "freetype"
brew "fzf"
brew "gauge"
brew "gawk"
brew "gcc"
brew "gd"
brew "gdbm"
brew "gdk-pixbuf"
brew "gemini-cli"
brew "gettext"
brew "gh"
brew "ghostscript"
brew "gifsicle"
brew "git"
brew "git-crypt"
brew "git-flow"
brew "git-quick-stats"
brew "git-secret"
brew "gmp"
brew "gnu-tar"
brew "gnupg"
brew "gnutls"
brew "go"
brew "goaccess"
brew "gobject-introspection"
brew "gomplate"
brew "goodwithtech/r/dockle"
brew "gradle"
brew "grafana"
brew "graphviz"
brew "groovy"
brew "gtk+"
brew "gts"
brew "harfbuzz"
brew "helm"
brew "hostess"
brew "htop"
brew "httpie"
brew "hwatch"
brew "imagemagick"
brew "jbig2dec"
brew "jenv"
brew "jetbrains/utils/qodana"
brew "jmeter"
brew "johanhaleby/kubetail/kubetail"
brew "jpeg"
brew "jpeg-xl"
brew "jq"
brew "jsonpp"
brew "k6"
brew "k8sgpt"
brew "kafka"
brew "kops", args: ["HEAD"]
brew "krew"
brew "kube-ps1"
brew "kubectx"
brew "kubeshark/kubeshark/kubeshark"
brew "libavif"
brew "libevent"
brew "libffi"
brew "libfido2"
brew "libgcrypt"
brew "libgpg-error"
brew "libheif"
brew "libidn2"
brew "libksba"
brew "libpng"
brew "libraw"
brew "librsvg"
brew "libtasn1"
brew "libtiff"
brew "libtool"
brew "libx11"
brew "libyaml"
brew "little-cms2"
brew "logstash"
brew "luajit"
brew "makedepend"
brew "mas"
brew "maven"
brew "mcfly"
brew "mercurial"
brew "mongocli"
brew "mongodb/brew/mongodb-community"
brew "mveritym/mel/kubedecode"
brew "mycli"
brew "mysql", restart_service: :changed
brew "navi"
brew "netpbm"
brew "nettle"
brew "nginx"
brew "nmap"
brew "node_exporter"
brew "nvm"
brew "ollama"
brew "oniguruma"
brew "openapi-generator"
brew "openjdk"
brew "openjdk@11"
brew "openjdk@17"
brew "openjdk@21"
brew "pandoc"
brew "pango"
brew "pcre"
brew "peco"
brew "perl"
brew "pipenv"
brew "pixman"
brew "pkgconf"
brew "pnpm"
brew "portmidi"
brew "powerlevel10k"
brew "pycparser"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.11"
brew "qt"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "recode"
brew "redis"
brew "rename"
brew "restcli/restcli/restcli"
brew "ruby-build"
brew "sbt"
brew "scala"
brew "schappim/ocr/ocr"
brew "sdl12-compat"
brew "siege"
brew "skaffold"
brew "socat"
brew "sonar-scanner"
brew "sonobuoy"
brew "spring-io/tap/spring-boot"
brew "sysdig"
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tmux-xpanes"
brew "tree"
brew "unbound"
brew "uv"
brew "v8"
brew "vim"
brew "virtualenv"
brew "watch"
brew "webp"
brew "wget"
brew "whatmask"
brew "wrk"
brew "wtf"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zookeeper"
brew "zplug"
brew "zsh"

# brew casks (brew install --cask)
cask "1password", args: { appdir: "/Applications" }
cask "alfred@4"
cask "arc"
cask "atom", args: { appdir: "/Applications" }
cask "charles", args: { appdir: "/Applications" }
cask "cursor"
cask "dash", args: { appdir: "/Applications" }
cask "evernote", args: { appdir: "/Applications" }
cask "fig", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "font-hack-nerd-font", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "hiddenbar"
cask "homerow"
cask "iterm2"
cask "jetbrains-toolbox", args: { appdir: "/Applications" }
cask "jiggler"
cask "lens", args: { appdir: "/Applications" }
cask "liteide", args: { appdir: "/Applications" }
cask "lm-studio"
cask "meetingbar"
cask "memoryanalyzer", args: { appdir: "/Applications" }
cask "mysqlworkbench", args: { appdir: "/Applications" }
cask "nosqlbooster-for-mongodb", args: { appdir: "/Applications" }
cask "notion", args: { appdir: "/Applications" }
cask "numi", args: { appdir: "/Applications" }
cask "obsidian", args: { appdir: "/Applications" }
cask "openlens"
cask "postman", args: { appdir: "/Applications" }
cask "raycast"
cask "razorsql", args: { appdir: "/Applications" }
cask "rectangle", args: { appdir: "/Applications" }
cask "scapple", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "sublime-text"
cask "the-unarchiver", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "wallpaper-wizard", args: { appdir: "/Applications" }

# mas apps (mas install)
mas "Clocker", id: 1056643111
mas "GIPHY CAPTURE", id: 668208984
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "OTP Manager", id: 928941247
mas "Pages", id: 409201541
mas "RocketFuel", id: 1114196460
mas "SimpleMind", id: 439654198
mas "Skitch", id: 425955336
mas "Teampaper", id: 1199502670
mas "Windows App", id: 1295203466
mas "iMovie", id: 408981434
mas "Snappy by Povio", id: 6502442568
mas "Unsplash Wallpapers", id: 1284863847

# vs code extensions
vscode "alphabotsec.vscode-eclipse-keybindings"
vscode "docker.docker"
vscode "donebd.vscode-keypromoter"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "mathiasfrohlich.kotlin"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.java"
vscode "saoudrizwan.claude-dev"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "withfig.fig"
