# Configs
cask_args appdir: '/Applications'

# Taps
tap "blacknon/hwatch"
tap "buo/cask-upgrade"
tap "c-bata/kube-prompt"
tap "cantino/mcfly"
tap "derailed/k9s"
tap "elastic/tap"
tap "goodwithtech/r"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "johanhaleby/kubetail"
tap "mveritym/homebrew-mel"
tap "pivotal/tap"
tap "romkatv/powerlevel10k"
tap "spring-io/tap"
tap "wagoodman/dive"


# Binaries/Libraries
brew "ansible"
brew "ansible-lint"
brew "ant"
brew "asciinema"
brew "atk"
brew "autoconf"
brew "autojump"
brew "automake"
brew "awscli"
brew "bash"
brew "broot"
brew "c-ares"
brew "cairo"
brew "cmake"
brew "consul"
brew "cowsay"
brew "cscope"
brew "ctags"
brew "dbus"
brew "dep"
brew "derailed/k9s/k9s"
brew "direnv"
brew "dive"
brew "extract_url"
brew "dos2unix"
brew "exa"
brew "faas-cli"
brew "figlet"
brew "fleetctl"
brew "fontconfig"
brew "fortune"
brew "freetype"
brew "fzf"
brew "gauge"
brew "gdbm"
brew "gdk-pixbuf"
brew "geoip"
brew "gettext"
brew "gh"
brew "ghostscript"
brew "gifsicle"
brew "git"
brew "git-crypt"
brew "git-flow"
brew "git-quick-stats"
brew "git-secret"
brew "gmp"
brew "gnu-tar"
brew "gnupg"
brew "gnutls"
brew "goaccess"
brew "gobject-introspection"
brew "gomplate"
brew "goodwithtech/r/dockle"
brew "gradle"
brew "grafana"
brew "graphviz"
brew "groovy"
brew "gtk+"
brew "harfbuzz"
brew "hostess"
brew "htop-osx"
brew "httpie"
brew "hwatch"
brew "icu4c"
brew "imagemagick"
brew "jbig2dec"
brew "jenv"
brew "jmeter"
brew "jpeg"
brew "jq"
brew "jsonpp"
brew "k9s"
brew "kafka"
brew "kops", args: ["HEAD"]
brew "kube-prompt"
brew "kube-ps1"
brew "kubectx"
brew "kubedecode"
brew "helm"
brew "kubetail"
brew "libevent"
brew "libffi"
brew "libgcrypt"
brew "libgpg-error"
brew "libksba"
brew "libpng"
brew "libtasn1"
brew "libtiff"
brew "libtool"
brew "libyaml"
brew "little-cms2"
brew "logstash"
brew "luajit"
brew "makedepend"
brew "mas"
brew "maven"
brew "mcfly"
brew "mercurial"
brew "mycli"
brew "mysql"
brew "navi"
brew "nettle"
brew "nmap"
brew "node"
brew "nvm"
brew "oniguruma"
brew "packer"
brew "pandoc"
brew "pango"
brew "pcre"
brew "peco"
brew "pipenv"
brew "pixman"
brew "pkg-config"
brew "portmidi"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "python3"
brew "qt"
brew "rbenv"
brew "readline"
brew "reattach-to-user-namespace"
brew "recode"
brew "rename"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "ruby-build"
brew "sbt"
brew "scala"
brew "sdl"
brew "sdl_image"
brew "sdl_mixer"
brew "sdl_ttf"
brew "siege"
brew "skaffold"
brew "springboot"
brew "sqlite"
brew "sysdig"
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tmux-xpanes"
brew "tree"
brew "v8"
brew "vim"
brew "watch"
brew "webp"
brew "wget"
brew "whatmask"
brew "wrk"
brew "wtf"
brew "xz"
brew "yq"
brew "zookeeper"
brew "zsh"

# Applications
# cask "bittorrent"
# cask "boostnote"
cask "1password"
cask "atom"
cask "charles"
cask "dash"
cask "docker"
cask "evernote"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-drive"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "jetbrains-toolbox"
cask "lens"
cask "liteide"
cask "macs-fan-control"
cask "mat"
cask "mysqlworkbench"
cask "nosqlbooster-for-mongodb"
cask "notion"
cask "numi"
cask "onedrive"
cask "postman"
cask "razorsql"
cask "rectangle"
cask "scapple"
cask "slack"
cask "the-unarchiver"
cask "vanilla"
cask "visual-studio-code"
cask "vmware-horizon-client"
cask "wallpaper-wizard"
cask "wireshark"

mas "Alfred", id: 405843582
mas "Clocker", id: 1056643111
mas "GarageBand", id: 682658836
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RocketFuel", id: 1114196460
mas "SimpleMind Lite", id: 439654198
mas "Skitch", id: 425955336
mas "Teampaper Snap", id: 1199502670
mas "Wallpapers HD Lite", id: 441812880
mas "feedly", id: 865500966
mas "iMovie", id: 408981434
